{
  "metadata": {
    "version": "5.0",
    "lastUpdated": "2026-01-05",
    "totalItems": 72
  },
  "staticContent": {
    "header": {
      "name": "Umberto Castaldo",
      "location": "New York, NY",
      "phone": "917 435 2003",
      "email": "Umberto.Castaldo@gmail.com"
    },
    "education": {
      "degree": "Bachelor of Business Administration",
      "field": "Business Management & Marketing Communications",
      "school": "Marist College"
    }
  },
  "conflictRules": [
    { "itemId": "CH-01", "conflictsWith": ["P1-B02"], "reason": "Both use $40M practice and 35+ strategists metrics" },
    { "itemId": "CH-02", "conflictsWith": ["P2-B08"], "reason": "Both use NWSL 50% attendance and $60M media deal metrics" },
    { "itemId": "CH-03", "conflictsWith": ["P1-B04"], "reason": "Both use OOFOS 191% sales and 54% acquisition metrics" },
    { "itemId": "CH-04", "conflictsWith": ["P1-B09"], "reason": "Both use Deloitte 43% lead gen and 33% relevancy metrics" },
    { "itemId": "CH-05", "conflictsWith": ["P2-B09"], "reason": "Both use PfizerForAll $727M revenue metric" },
    { "itemId": "CH-06", "conflictsWith": ["P1-B08"], "reason": "Both use LTK $2.8B to $5B scaling metric" },
    { "itemId": "CH-07", "conflictsWith": ["P1-B05"], "reason": "Both use NYU Langone 1.6M appointments metric" },
    { "itemId": "CH-08", "conflictsWith": ["P1-B07"], "reason": "Both use Gateway 30K members metric" },
    { "itemId": "CH-09", "conflictsWith": ["P1-B03"], "reason": "Both use Amex 5% retention and 12% cross-sell metrics" },
    { "itemId": "CH-10", "conflictsWith": ["P4-B01", "P4-B02"], "reason": "All use GE innovation and Cannes Grand Prix metrics" }
  ],
  "items": [
    {
      "id": "SUM-B2B",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto helps complex organizations figure out what their brand actually means - and then make it work harder. Over 15 years, he's partnered with enterprise leaders navigating messy realities: post-merger identity crises, product portfolios that don't cohere, and growth ambitions that outpace the story. His work spans the Fortune 500 - companies like General Electric, American Express, and UBS - where brand decisions involve dozens of stakeholders, competing priorities, and executives who need to see the business case before they'll move. He's learned that in enterprise environments, the best brand strategy is the one that gets buy-in. That means building frameworks CFOs can defend, narratives product teams can rally around, and platforms that scale across business units without losing coherence. At Deloitte Digital, he built the brand practice by proving that strategic clarity drives alignment - and alignment drives growth.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte"],
      "categoryTags": ["B2B", "enterprise"],
      "functionTags": ["brand-strategy", "executive-advisory", "transformation"],
      "industryTags": ["B2B", "enterprise", "professional-services", "technology"],
      "themeTags": ["complex-organizations", "stakeholder-management", "enterprise-scale"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-FS",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto builds brands for financial services companies navigating a fundamental shift: from product-led positioning to customer-centric differentiation. Over 15 years, he's partnered with institutions like American Express, Capital One, New York Life, Synovus, and UBS to develop brand strategies that resonate in categories where trust is everything and switching costs are high. He understands the unique constraints of regulated industries - the compliance reviews, the legal sign-offs, the stakeholder complexity - and has learned to build brand platforms that survive them intact. His work includes repositioning regional banks for growth, developing wealth management brands that speak to next-generation clients, and creating brand architectures that unify acquisitions without losing what made them valuable. At Deloitte Digital, he established deep expertise in financial services by leading engagements that connected brand strategy to the metrics that matter: customer acquisition, deposit growth, and share of wallet.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte", "American Express", "Capital One", "New York Life", "Synovus", "UBS"],
      "categoryTags": ["financial-services"],
      "functionTags": ["brand-strategy", "brand-architecture", "client-advisory"],
      "industryTags": ["financial-services", "banking", "wealth-management", "insurance"],
      "themeTags": ["regulated-industries", "trust", "customer-acquisition"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-TECH",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto builds brands for technology companies at inflection points - the moments when product-market fit demands a story that scales. Over 15 years, he's partnered with tech leaders navigating the transition from feature competition to category definition, helping them articulate what they stand for beyond what they build. His work spans enterprise software, consumer platforms, and emerging tech - including pioneering AI-powered brand solutions that accelerated speed-to-market while reducing production costs. He's learned that technology brands face a unique challenge: translating complex capabilities into human terms without dumbing them down. The best tech brands don't just explain what the product does - they capture why it matters and who it's for. At Deloitte Digital, he built expertise in technology brand strategy by helping clients scale from startup to category leader, developing brand platforms that supported major funding rounds and drove measurable acquisition growth.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte"],
      "categoryTags": ["technology"],
      "functionTags": ["brand-strategy", "product-marketing", "growth-strategy"],
      "industryTags": ["technology", "SaaS", "enterprise-software", "platforms"],
      "themeTags": ["category-definition", "innovation", "AI", "digital-transformation"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-CON",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto builds brands that consumers actually notice - and remember. Over 15 years, he's partnered with consumer companies navigating the hardest challenge in marketing: breaking through in categories where attention is scarce and loyalty is fragile. His work spans CPG giants like Walmart and Pfizer, challenger brands redefining their categories, and cultural institutions like the National Women's Soccer League. He's led campaigns recognized by Cannes Lions, The Webby Awards, and AdAge - but the awards matter less than what earned them: work that connected brand strategy to cultural relevance. He's learned that consumer brands win by understanding not just what people buy, but why they care. That means building brand platforms rooted in genuine insight, creative work that respects the audience, and activation strategies that meet consumers where they actually are. At Deloitte Digital, he built the brand practice by delivering consumer engagements that drove measurable results - including repositioning a challenger footwear brand as a category leader.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte", "Walmart", "Pfizer", "NWSL"],
      "categoryTags": ["consumer"],
      "functionTags": ["brand-strategy", "integrated-campaign", "creative-strategy"],
      "industryTags": ["consumer", "CPG", "retail", "DTC", "sports-entertainment"],
      "themeTags": ["cultural-relevance", "consumer-insight", "brand-building"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-CE",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto builds brands that break through. Over 15 years, he's led creative work for companies like Pfizer, American Express, General Electric, and the National Women's Soccer League - campaigns recognized by Cannes Lions, The Webby Awards, AdAge, and The Healthcare Marketing Awards. But he's never believed that awards are the goal. The goal is work that moves people: brand stories that make complex companies feel human, campaigns that turn business strategy into cultural conversation, creative platforms that give teams something worth making. He's learned that creative excellence requires more than good taste - it requires strategic clarity. The best creative work comes from teams who understand exactly what the brand stands for and who it's for. At Deloitte Digital, he built a brand practice that consistently delivers both: strategy that inspires creative teams and creative work that delivers business results. His portfolio includes brand platforms that earned Cannes Grand Prix recognition and storytelling innovations that reached #1 on iTunes.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte", "Pfizer", "American Express", "GE", "NWSL"],
      "categoryTags": ["creative"],
      "functionTags": ["creative-strategy", "brand-storytelling", "integrated-campaign"],
      "industryTags": ["consumer", "healthcare", "B2B", "technology"],
      "themeTags": ["creative-excellence", "campaigns", "awards", "storytelling"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-PM",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto builds the strategic foundation that makes products succeed in market. Over 15 years, he's led positioning and go-to-market work for companies ranging from Fortune 500 enterprises to high-growth disruptors - helping them articulate what makes their product different, why it matters, and how to tell that story at every stage of the buyer journey. His work spans complex B2B portfolios, consumer product launches, and technology platforms scaling into new markets. He's learned that great product marketing starts before the campaign - it starts with positioning that sales teams can actually use, messaging that survives contact with real customers, and competitive differentiation that holds up under scrutiny. At Deloitte Digital, he built expertise in product marketing by developing frameworks that connect brand positioning to pipeline performance. His engagements have driven measurable results: increased qualified opportunities, improved acquisition rates, and go-to-market strategies that helped clients scale from Series B to category leadership.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte"],
      "categoryTags": ["product-marketing"],
      "functionTags": ["product-marketing", "positioning", "GTM", "sales-enablement"],
      "industryTags": ["B2B", "technology", "SaaS", "enterprise-software"],
      "themeTags": ["go-to-market", "launches", "pipeline", "competitive-differentiation"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-BS",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto defines what brands stand for - and builds the systems that make it stick. Over 15 years, he's led brand strategy for companies navigating moments that demand clarity: post-merger integrations, portfolio simplifications, market repositionings, and growth inflections that outpace the current story. His work spans Fortune 500 enterprises like General Electric, American Express, and Pfizer, as well as challenger brands redefining their categories. He's developed brand architectures that unify sprawling portfolios, positioning platforms that differentiate in crowded markets, and identity systems that scale across business units and geographies. He's learned that brand strategy only matters if it gets adopted. That means building frameworks executives can defend, creative teams can execute, and organizations can sustain. At Deloitte Digital, he established brand strategy as a practice area by proving that positioning clarity drives business outcomes - improved brand relevance, stronger differentiation, and revenue growth for clients who invested in getting the foundation right.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte", "GE", "American Express", "Pfizer"],
      "categoryTags": ["brand-strategy"],
      "functionTags": ["brand-strategy", "brand-architecture", "positioning"],
      "industryTags": ["professional-services", "B2B", "consumer", "healthcare"],
      "themeTags": ["brand-architecture", "messaging", "identity-systems", "transformation"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "SUM-PG",
      "type": "summary",
      "position": null,
      "contentLong": "Umberto connects brand strategy to growth outcomes. Over 15 years, he's led engagements that prove brand investment drives measurable results - not someday, but in the metrics that matter now: customer acquisition, conversion rates, retention, and lifetime value. His work spans Fortune 500 enterprises optimizing marketing efficiency and growth-stage companies scaling acquisition engines. He's developed brand platforms that improved CAC by connecting positioning to performance, led campaigns that drove significant attendance and acquisition growth, and built AI-powered solutions that reduced production costs while accelerating speed-to-market. He's learned that brand and performance aren't opposing forces - they're multipliers. The best growth marketing is built on positioning that resonates, creative that converts, and measurement systems that connect brand investment to pipeline. At Deloitte Digital, he built the brand practice by delivering engagements with clear performance outcomes: improved customer acquisition, stronger favorability, and brand strategies that CFOs could see reflected in the numbers.",
      "contentMedium": null,
      "contentShort": null,
      "contentGeneric": null,
      "brandTags": ["Deloitte"],
      "categoryTags": ["performance", "growth"],
      "functionTags": ["growth-marketing", "performance-marketing", "demand-generation"],
      "industryTags": ["B2B", "technology", "consumer", "financial-services"],
      "themeTags": ["acquisition", "conversion", "metrics", "ROI", "pipeline"],
      "outcomeTags": [],
      "exclusiveMetrics": []
    },
    {
      "id": "CH-01",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Built Deloitte's brand strategy practice from ground up to $40M with 35+ strategists",
      "contentMedium": "Built and scaled Deloitte's brand strategy practice from ground up to $40M, assembling 35+ strategists and achieving 3x growth in Fortune 500 initiatives",
      "contentLong": "Recruited to launch Deloitte's brand strategy practice from the ground up. Built a $40M offering by assembling and leading a team of 35+ strategists, securing executive-level client relationships, and expanding brand transformation work across industries. The practice achieved 3x growth in Fortune 500 initiatives and established Deloitte as a leader in strategic brand consulting",
      "contentGeneric": "Built a consulting firm's brand strategy practice from ground up to $40M, assembling 35+ strategists and achieving 3x growth in Fortune 500 initiatives",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["practice-building", "team-leadership", "p&l-management", "business-development"],
      "outcomeTags": ["revenue-growth", "team-scale", "market-leadership"],
      "exclusiveMetrics": ["$40M", "$15M", "35+ strategists", "3x growth"]
    },
    {
      "id": "CH-02",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Partnered with professional sports league to drive 50% attendance growth and secure $60M media deal",
      "contentMedium": "Partnered with major women's sports league to define brand strategy, driving 50% YoY attendance growth and securing $60M media rights deal (40x increase)",
      "contentLong": "Partnered with professional sports league at pivotal growth moment to define its first long-term brand and business strategy. Developed market positioning, fan engagement roadmap, and campaign ecosystem that drove 50% YoY attendance increase, an additional 26% growth in year two, and secured $60M media rights deal—a 40x value increase",
      "contentGeneric": "Partnered with professional sports league to drive 50% YoY attendance growth and secure $60M media rights deal representing 40x value increase",
      "brandTags": ["NWSL"],
      "categoryTags": ["sports", "entertainment", "media"],
      "functionTags": ["brand-strategy", "business-development", "partnership", "market-positioning"],
      "outcomeTags": ["attendance-growth", "revenue-growth", "media-deal", "market-expansion"],
      "exclusiveMetrics": ["50% YoY attendance", "$60M media rights", "40x increase", "26% growth"]
    },
    {
      "id": "CH-03",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Repositioned recovery footwear brand to category leader, driving 191% sales increase",
      "contentMedium": "Repositioned recovery footwear brand from niche player to category leader through brand strategy and DTC expansion, driving 191% sales increase and 54% new customer acquisition",
      "contentLong": "Partnered with athletic recovery brand to transform from niche player into category leader. Led development of brand strategy, segmentation roadmap, and omnichannel campaign focused on customer acquisition. Repositioned brand around performance recovery, resulting in 191% sales increase, 54% new customer acquisition growth, and 82% year-over-year revenue increase",
      "contentGeneric": "Repositioned recovery footwear brand from niche player to category leader, driving 191% sales increase and 54% new customer acquisition growth",
      "brandTags": ["OOFOS"],
      "categoryTags": ["consumer", "footwear", "dtc", "retail"],
      "functionTags": ["brand-repositioning", "segmentation", "campaign-development", "digital-strategy"],
      "outcomeTags": ["sales-growth", "customer-acquisition", "traffic-growth", "category-leadership"],
      "exclusiveMetrics": ["191% sales", "54% acquisition", "47% traffic", "82% YoY revenue"]
    },
    {
      "id": "CH-04",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Led Deloitte rebrand expanding beyond audit, generating 43% lead increase",
      "contentMedium": "Led end-to-end Deloitte repositioning to expand perception beyond audit, driving integrated campaign that generated 43% lead increase and 33% relevancy lift",
      "contentLong": "Led the end-to-end repositioning of Deloitte's corporate brand to expand market perception beyond tax and audit. Designed new brand architecture and narrative strategy centered on business outcomes. The integrated campaign drove 43% increase in lead generation, 33% lift in brand relevancy, and 20% rise in awareness across five key industries",
      "contentGeneric": "Led corporate rebrand to expand perception beyond core services, driving 43% lead generation increase and 33% brand relevancy lift",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["corporate-rebranding", "market-positioning", "lead-generation", "brand-strategy"],
      "outcomeTags": ["lead-generation", "brand-perception", "market-relevance", "awareness-growth"],
      "exclusiveMetrics": ["43% lead generation", "33% brand relevancy", "20% awareness"]
    },
    {
      "id": "CH-05",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Launched healthcare DTC platform exceeding forecasts by 20% with $727M revenue",
      "contentMedium": "Branded and launched pharmaceutical company's direct-to-consumer platform, positioning as digital health partner and exceeding Q1 forecasts by 20% with $727M revenue",
      "contentLong": "Partnered with global pharmaceutical company to brand and launch direct-to-consumer platform expanding at-home healthcare access. Led positioning strategy framing company as trusted digital healthcare partner. The launch exceeded first-quarter forecasts by 20%, generating $727M in revenue and establishing scalable model for future care delivery",
      "contentGeneric": "Branded and launched healthcare direct-to-consumer platform, exceeding forecasts by 20% with $727M in revenue",
      "brandTags": ["Pfizer", "PfizerForAll"],
      "categoryTags": ["healthcare", "pharmaceutical", "digital-health"],
      "functionTags": ["platform-strategy", "brand-launch", "dtc-strategy", "go-to-market"],
      "outcomeTags": ["revenue-generation", "platform-success", "market-launch", "performance-excellence"],
      "exclusiveMetrics": ["$727M revenue", "20% above forecast"]
    },
    {
      "id": "CH-06",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Built global brand strategy post-$300M investment, scaling platform from $2.8B to $5B",
      "contentMedium": "Built creator commerce platform's first global brand strategy post-$300M investment, launching campaign that drove 8% customer acquisition and scaled platform from $2.8B to $5B",
      "contentLong": "Following technology platform's $300M investment from major VC, led development of first global brand strategy to position for accelerated growth. Established brand platform that reframed company from transactional tool to trusted content-commerce destination. Campaign resulted in 8% customer acquisition increase, 67% awareness lift, and scaling from $2.8B to nearly $5B in annual sales",
      "contentGeneric": "Built first global brand strategy post-major investment, scaling platform from $2.8B to $5B in annual sales",
      "brandTags": ["LTK"],
      "categoryTags": ["technology", "fashion", "creator-economy", "ecommerce"],
      "functionTags": ["global-brand-strategy", "platform-scaling", "growth-strategy", "user-acquisition"],
      "outcomeTags": ["revenue-scaling", "customer-acquisition", "brand-awareness", "platform-engagement"],
      "exclusiveMetrics": ["$300M investment", "$2.8B to $5B", "8% acquisition", "67% awareness", "22% favorability"]
    },
    {
      "id": "CH-07",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Developed hospital campaign generating 1.6M new appointments and #1 ranking",
      "contentMedium": "Developed 'Best Outcomes' campaign for major healthcare system, distinguishing hospital in competitive market and generating 1.6M new appointments while achieving #1 ranking",
      "contentLong": "Partnered with academic medical center to develop new brand campaign distinguishing the hospital in competitive NYC market. Created platform aligning narrative, patient experience, and communications. Campaign drove 10% lift in awareness, 300% increase in social engagement, and 1.6M net-new patient appointments, contributing to #1 hospital ranking",
      "contentGeneric": "Developed brand campaign for major healthcare system, generating 1.6M new patient appointments and contributing to #1 market ranking",
      "brandTags": ["NYU Langone"],
      "categoryTags": ["healthcare", "hospital", "academic-medical"],
      "functionTags": ["campaign-development", "healthcare-marketing", "competitive-positioning", "patient-acquisition"],
      "outcomeTags": ["patient-growth", "market-leadership", "brand-recognition", "market-ranking"],
      "exclusiveMetrics": ["1.6M appointments", "#1 ranking", "10% awareness", "300% social"]
    },
    {
      "id": "CH-08",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Led healthcare rebrand following acquisition, driving 30,000-member increase",
      "contentMedium": "Led regional Medicaid provider rebrand following acquisition, developing human-centered platform that drove 30,000-member increase and 35% traffic lift",
      "contentLong": "Following health system's acquisition of regional Medicaid provider, led complete rebrand signaling shift toward whole-person care. Developed brand platform rooted in insight that members want to feel genuinely cared for. Rebrand drove 30,000-member enrollment increase, 35% web traffic rise, and surpassed 410,000 total members within 18 months",
      "contentGeneric": "Led regional healthcare provider rebrand following acquisition, driving 30,000-member increase and 35% traffic lift",
      "brandTags": ["Gateway Health", "Highmark Wholecare"],
      "categoryTags": ["healthcare", "insurance", "medicaid"],
      "functionTags": ["corporate-rebrand", "acquisition-integration", "brand-platform", "member-marketing"],
      "outcomeTags": ["member-growth", "enrollment-increase", "brand-favorability", "market-expansion"],
      "exclusiveMetrics": ["30,000 members", "410,000 total", "35% traffic", "6% favorability"]
    },
    {
      "id": "CH-09",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Modernized corporate card CRM delivering 5% retention lift and 12% cross-sell improvement",
      "contentMedium": "Modernized financial services corporate card CRM shifting to customer-centric approach using AI personalization, delivering 5% retention lift and 12% cross-sell improvement",
      "contentLong": "Led CRM strategy transformation for global payment company's corporate cards, addressing plateauing performance by shifting from transactional to customer-centric approach. Developed segmentation frameworks using behavioral data and AI personalization. Initiative drove 5% lift in retention and 12% increase in cross-sell and upsell performance across portfolio",
      "contentGeneric": "Modernized corporate card CRM using AI personalization, delivering 5% retention lift and 12% cross-sell improvement",
      "brandTags": ["American Express"],
      "categoryTags": ["financial-services", "payments"],
      "functionTags": ["crm-development", "segmentation", "ai-personalization", "b2b-marketing"],
      "outcomeTags": ["customer-retention", "cross-sell-growth", "personalization"],
      "exclusiveMetrics": ["5% retention", "12% cross-sell"]
    },
    {
      "id": "CH-10",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Pioneered award-winning media innovation earning Cannes Grand Prix and 4x engagement increase",
      "contentMedium": "Pioneered industrial company's media innovation including #1 iTunes podcast and VR campaign, earning Cannes Grand Prix and driving 4x engagement increase",
      "contentLong": "Pioneered award-winning media innovation for Fortune 50 manufacturer including branded podcast that became #1 on iTunes and national VR campaign distributing 1M headsets. Work earned industry acclaim including Cannes Grand Prix, Clio, and Webby awards while driving 4x increase in branded content engagement and establishing company as innovation leader",
      "contentGeneric": "Pioneered award-winning media innovation including #1 podcast and VR campaign, earning Cannes Grand Prix and driving 4x engagement increase",
      "brandTags": ["GE", "General Electric"],
      "categoryTags": ["industrial", "b2b", "media", "technology"],
      "functionTags": ["media-strategy", "content-creation", "brand-innovation", "entertainment-marketing"],
      "outcomeTags": ["brand-engagement", "cultural-impact", "award-recognition", "perception-shift"],
      "exclusiveMetrics": ["Cannes Grand Prix", "#1 iTunes", "4x engagement", "1M VR headsets"]
    },
    {
      "id": "CH-11",
      "type": "career_highlight",
      "position": null,
      "contentShort": "Designed AI-powered solutions reducing production costs by 32%",
      "contentMedium": "Designed AI-powered brand solutions and automation workflows, reducing production costs by 32% while accelerating speed-to-market for Fortune 500 clients",
      "contentLong": "Spearheaded development of AI-powered brand strategy tools including generative agents and automation workflows. These solutions streamlined production processes and elevated strategic quality while reducing internal production costs by 32% and significantly increasing speed-to-market for Fortune 500 clients",
      "contentGeneric": "Designed AI-powered brand solutions and automation workflows, reducing production costs by 32% while accelerating speed-to-market",
      "brandTags": ["Deloitte"],
      "categoryTags": ["technology", "ai", "martech"],
      "functionTags": ["tool-development", "workflow-automation", "process-innovation", "ai-integration"],
      "outcomeTags": ["cost-reduction", "speed-improvement", "quality-enhancement", "operational-efficiency"],
      "exclusiveMetrics": ["32% cost reduction"]
    },
    {
      "id": "OV-P1",
      "type": "overview",
      "position": 1,
      "contentShort": "Leads Deloitte's $40M Brand Strategy & Activation practice, advising Fortune 500 executives on brand transformation.",
      "contentMedium": "Leads Deloitte's Brand Strategy & Activation practice, serving as trusted advisor to Fortune 500 executives on repositioning brand as a business growth engine. Oversees a team of 35+ strategists delivering enterprise-scale brand transformation.",
      "contentLong": "Promoted to lead Deloitte's Brand Strategy & Activation practice during a time when CMOs faced increasing pressure to tie brand investment to enterprise value. Became a trusted advisor to Fortune 500 executives, repositioning brand from a marketing function to a business growth engine—and transforming how organizations define, express, and scale brand equity across the enterprise. Built and lead a 35+ person strategy team and oversaw engagements that helped a major health system reclaim its #1 category position, scaled a fashion technology platform from $2.8B to nearly $5B in annual sales, reintroduced a challenger footwear brand as a category leader, and revitalized CRM performance for one of the world's largest financial services companies.",
      "contentGeneric": "Leads a major consulting firm's brand strategy practice, advising Fortune 500 executives on brand transformation and enterprise positioning. Manages 35+ strategists across healthcare, technology, and financial services sectors.",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["practice-leadership", "executive-advisory", "team-management"],
      "outcomeTags": ["enterprise-transformation", "market-leadership"],
      "exclusiveMetrics": []
    },
    {
      "id": "OV-P2",
      "type": "overview",
      "position": 2,
      "contentShort": "Established brand consulting model bridging creative excellence with management consulting rigor.",
      "contentMedium": "Recruited to establish a new brand consulting model bridging creative excellence with management consulting rigor, developing proprietary frameworks that deliver measurable business impact.",
      "contentLong": "Recruited to establish a new brand consulting model that bridges creative excellence with management consulting rigor. Developed proprietary frameworks that position every customer touchpoint as an opportunity for both brand building and revenue generation. Grew practice by demonstrating how strategic creativity delivers measurable business impact across Fortune 500 client portfolio.",
      "contentGeneric": "Established brand consulting model bridging creative excellence with management consulting rigor, developing proprietary frameworks that deliver measurable business impact.",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["practice-development", "framework-creation", "client-engagement"],
      "outcomeTags": ["business-impact", "client-portfolio-growth"],
      "exclusiveMetrics": []
    },
    {
      "id": "OV-P3",
      "type": "overview",
      "position": 3,
      "contentShort": "Led innovation across brand, technology, and consumer experience for global brands.",
      "contentMedium": "Led innovation across brand, technology, and consumer experience for global brands, building scalable capabilities in personalization, content automation, and emerging media.",
      "contentLong": "Promoted to lead innovation across brand, technology, and consumer experience—helping global brands pilot future-facing solutions that would redefine how they connect, create, and grow. Focused on building scalable capabilities in personalization, content automation, and emerging media, while bridging creative, data, and digital strategy. Over two years, helped launch industry-first branded entertainment platforms, accelerate time-to-market through GenAI and automation tools, and shape new models for brand experimentation and IP development.",
      "contentGeneric": "Led innovation across brand, technology, and consumer experience for global brands, building scalable capabilities in personalization, content automation, and emerging media.",
      "brandTags": ["Omnicom"],
      "categoryTags": ["media", "advertising"],
      "functionTags": ["innovation-leadership", "capability-building", "emerging-media"],
      "outcomeTags": ["platform-launch", "automation", "brand-innovation"],
      "exclusiveMetrics": []
    },
    {
      "id": "OV-P4",
      "type": "overview",
      "position": 4,
      "contentShort": "Led GE's global brand storytelling and media innovation.",
      "contentMedium": "Led GE's global brand storytelling and media innovation, translating complex technology narratives into culturally resonant experiences through podcasting, VR, and content partnerships.",
      "contentLong": "Recruited to lead GE's global brand storytelling and innovation strategy, with a mandate to reimagine how the company connected with audiences through emerging media. Focused on translating GE's complex technology narratives into culturally resonant experiences—using platforms like branded podcasting, VR, and content partnerships to modernize brand perception. Led award-winning initiatives that redefined how GE showed up in culture, while laying the groundwork for future-facing media models that blended brand, entertainment, and technology.",
      "contentGeneric": "Led global brand storytelling and media innovation for Fortune 50 manufacturer, translating complex technology narratives into culturally resonant experiences.",
      "brandTags": ["GE", "OMD"],
      "categoryTags": ["industrial", "media", "innovation"],
      "functionTags": ["media-innovation", "brand-storytelling", "content-partnerships"],
      "outcomeTags": ["brand-perception", "cultural-relevance", "award-recognition"],
      "exclusiveMetrics": []
    },
    {
      "id": "OV-P5",
      "type": "overview",
      "position": 5,
      "contentShort": "Developed brand strategy systems for B2B and industrial clients undergoing transformation.",
      "contentMedium": "Developed brand strategy systems for B2B and industrial clients undergoing business transformation, focusing on positioning, messaging, and brand architecture.",
      "contentLong": "Developed foundational brand strategy systems for B2B and industrial clients undergoing business transformation. Focused on positioning, messaging, and brand architecture to unify offerings and drive clarity across complex organizations.",
      "contentGeneric": "Developed brand strategy systems for B2B and industrial clients undergoing transformation, focusing on positioning, messaging, and brand architecture.",
      "brandTags": ["Straightline"],
      "categoryTags": ["b2b", "consulting"],
      "functionTags": ["brand-strategy", "positioning", "messaging", "brand-architecture"],
      "outcomeTags": ["organizational-clarity", "transformation-support"],
      "exclusiveMetrics": []
    },
    {
      "id": "OV-P6",
      "type": "overview",
      "position": 6,
      "contentShort": "Supported brand positioning and campaign development across consumer, tech, and B2B categories.",
      "contentMedium": "Supported brand positioning and campaign development across consumer, tech, and B2B categories, building audience personas and messaging frameworks.",
      "contentLong": "Supported brand positioning and campaign development across consumer, tech, and B2B categories. Built audience personas, messaging frameworks, and foundational strategy tools that contributed to winning pitches and long-term brand building.",
      "contentGeneric": "Supported brand positioning and campaign development across consumer, tech, and B2B categories.",
      "brandTags": ["WPP", "Berlin Cameron"],
      "categoryTags": ["advertising", "creative-agency"],
      "functionTags": ["brand-positioning", "campaign-development", "audience-strategy"],
      "outcomeTags": ["pitch-success", "brand-building"],
      "exclusiveMetrics": []
    },
    {
      "id": "P1-B01",
      "type": "bullet",
      "position": 1,
      "contentShort": "Repositioned regional bank driving 64.3% revenue growth and 9% customer acquisition increase",
      "contentMedium": "Developed brand strategy for regional banking provider, driving 9% customer acquisition and 64.3% revenue growth",
      "contentLong": "Developed a differentiated and category-distinct brand strategy and creative platform to reposition Synovus as a relationship-driven B2B banking partner amid declining market share and mindshare. Led messaging, identity refresh, and agency-led campaign storytelling to drive alignment and brand clarity. The new platform drove a 9% increase in new customer acquisition, lifted brand favorability by 12%, boosted digital engagement by 11%, and contributed to 64.3% revenue growth between 2021 and 2023",
      "contentGeneric": "Developed brand strategy for regional financial institution, driving 9% customer acquisition and 64.3% revenue growth",
      "brandTags": ["Synovus"],
      "categoryTags": ["financial-services", "banking", "b2b"],
      "functionTags": ["brand-repositioning", "messaging-strategy", "campaign-development"],
      "outcomeTags": ["customer-acquisition", "brand-favorability", "revenue-growth"],
      "exclusiveMetrics": ["9% customer acquisition", "12% brand favorability", "64.3% revenue growth", "11% digital engagement"]
    },
    {
      "id": "P1-B02",
      "type": "bullet",
      "position": 1,
      "contentShort": "Scaled practice from $15M to $40M while building 35+ person team",
      "contentMedium": "Scaled brand strategy practice from $15M to $40M by expanding team to 35+ strategists",
      "contentLong": "Scaled Deloitte's Brand Strategy & Activation practice from a $15M to $40M business by expanding the team to 35+ strategists and deepening partnerships with Fortune 500 clients. Grew brand-led initiatives across industries and partnered with global creative agencies to activate new brand platforms and integrated campaigns—positioning the practice as a driver of enterprise value and brand transformation.",
      "contentGeneric": "Scaled brand strategy practice from $15M to $40M by expanding team to 35+ strategists and deepening Fortune 500 partnerships",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["business-development", "team-expansion", "client-relations", "p&l-management"],
      "outcomeTags": ["revenue-growth", "team-scale", "market-position"],
      "exclusiveMetrics": ["$15M to $40M", "35+ strategists"]
    },
    {
      "id": "P1-B03",
      "type": "bullet",
      "position": 1,
      "contentShort": "Modernized CRM achieving 5% retention lift and 12% cross-sell improvement with 32% cost reduction",
      "contentMedium": "Modernized CRM strategy delivering 5% retention lift and 12% cross-sell improvement with 32% cost reduction",
      "contentLong": "Modernized CRM strategy for a portfolio of clients across financial services, hospitality, and retail by replacing legacy journey-based models with a dynamic, moments-based engagement framework powered by AI and predictive personalization. Designed and implemented automated content systems and GenAI-enabled tools that accelerated execution, improved message relevance, and unlocked more personalized brand experiences at scale. On average, this approach delivered a 5% lift in customer retention, a 12% increase in cross-sell performance, and a 32% reduction in production costs.",
      "contentGeneric": "Modernized CRM strategy across financial services, hospitality, and retail, delivering 5% retention lift and 12% cross-sell improvement with 32% cost reduction",
      "brandTags": ["American Express"],
      "categoryTags": ["financial-services", "hospitality", "retail"],
      "functionTags": ["crm-transformation", "ai-integration", "automation", "personalization-strategy"],
      "outcomeTags": ["customer-retention", "cross-sell-performance", "cost-reduction"],
      "exclusiveMetrics": ["5% retention lift", "12% cross-sell", "32% cost reduction"]
    },
    {
      "id": "P1-B04",
      "type": "bullet",
      "position": 1,
      "contentShort": "Built segmentation strategy driving 54% customer acquisition increase and 47% web traffic growth",
      "contentMedium": "Developed segmentation-led growth strategy driving 54% customer acquisition and 47% traffic growth",
      "contentLong": "Partnered with a high-growth recovery footwear brand to define its path from niche player to category leader. Led the development of a segmentation-led growth strategy, modernized the eCommerce experience, and established a new brand platform and acquisition campaign. The work contributed to a 54% increase in new customer acquisition, a 47% lift in web traffic, and laid the foundation for sustained double-digit revenue growth year-over-year.",
      "contentGeneric": "Developed segmentation-led growth strategy for consumer brand, driving 54% customer acquisition and 47% traffic growth",
      "brandTags": ["OOFOS"],
      "categoryTags": ["consumer", "footwear", "dtc", "retail"],
      "functionTags": ["growth-strategy", "segmentation", "brand-platform", "ecommerce"],
      "outcomeTags": ["customer-acquisition", "traffic-growth", "revenue-growth"],
      "exclusiveMetrics": ["54% customer acquisition", "47% traffic growth"]
    },
    {
      "id": "P1-B05",
      "type": "bullet",
      "position": 1,
      "contentShort": "Developed integrated campaign generating 1.6M patient appointments and 300% social engagement increase",
      "contentMedium": "Led 'Best Outcomes' campaign generating 1.6M patient appointments and 300% social engagement lift",
      "contentLong": "Led the development and execution of NYU Langone's 'Best Outcomes' campaign to elevate brand perception in a highly competitive healthcare market. Built an integrated messaging system that aligned paid, owned, and in-hospital experiences around a unified brand narrative. The campaign generated 1.6M net-new patient appointments, exceeded social engagement benchmarks by 300%, and contributed to NYU's rise to the #1 hospital ranking in New York.",
      "contentGeneric": "Led integrated healthcare campaign generating 1.6M patient appointments and 300% social engagement increase, contributing to #1 market ranking",
      "brandTags": ["NYU Langone"],
      "categoryTags": ["healthcare", "hospital"],
      "functionTags": ["campaign-development", "messaging-system", "healthcare-marketing"],
      "outcomeTags": ["patient-appointments", "social-engagement", "market-ranking"],
      "exclusiveMetrics": ["1.6M patient appointments", "300% social engagement", "#1 hospital ranking"]
    },
    {
      "id": "P1-B06",
      "type": "bullet",
      "position": 1,
      "contentShort": "Created first-ever Cell & Gene Therapy platform driving 20% sales overperformance",
      "contentMedium": "Developed first global Cell & Gene Therapy brand platform, driving stakeholder engagement and sales performance",
      "contentLong": "Developed the first global brand strategy platform and corporate campaign for a leading pharmaceutical company to raise awareness of the emerging Cell & Gene Therapy treatment class. Partnered with R&D, corporate affairs, and biopharma leadership to translate complex science into a clear, human-centered narrative aligned with the enterprise brand. Launched an always-on integrated campaign supported by strategic benefit partnerships, driving stakeholder engagement across policy, provider, and patient communities.",
      "contentGeneric": "Developed first-of-kind brand strategy platform for emerging treatment class, translating complex science into human-centered narrative across stakeholder communities",
      "brandTags": ["Johnson & Johnson"],
      "categoryTags": ["healthcare", "pharmaceutical", "biotech"],
      "functionTags": ["platform-development", "corporate-campaign", "scientific-translation", "stakeholder-strategy"],
      "outcomeTags": ["stakeholder-engagement", "awareness-building", "sales-performance"],
      "exclusiveMetrics": ["20% sales overperformance"]
    },
    {
      "id": "P1-B07",
      "type": "bullet",
      "position": 1,
      "contentShort": "Led healthcare rebrand adding 30,000 members and 35% web traffic increase",
      "contentMedium": "Led Medicaid provider rebrand driving 30,000 member increase and 35% traffic lift",
      "contentLong": "Led the full rebrand of a regional Medicaid provider following its acquisition by a national health system, repositioning the organization as a holistic, human-centered brand. Built the 'Wholecare' platform around the insight that members don't just want coverage—they want to feel genuinely cared for. Oversaw identity development, messaging strategy, and integrated campaign activation. The launch drove a 30,000-member increase, a 35% lift in web traffic, and contributed to membership growth exceeding 410,000 within 18 months.",
      "contentGeneric": "Led regional healthcare provider rebrand, driving 30,000 member increase and 35% traffic lift within 18 months",
      "brandTags": ["Gateway Health", "Highmark Wholecare"],
      "categoryTags": ["healthcare", "insurance", "medicaid"],
      "functionTags": ["corporate-rebrand", "acquisition-integration", "identity-development"],
      "outcomeTags": ["member-growth", "traffic-increase", "market-expansion"],
      "exclusiveMetrics": ["30,000 member increase", "35% traffic lift", "410,000 total members"]
    },
    {
      "id": "P1-B08",
      "type": "bullet",
      "position": 1,
      "contentShort": "Launched first global campaign driving 12% engagement lift and 8% customer acquisition increase",
      "contentMedium": "Led global brand campaign driving 12% engagement lift and 8% customer acquisition",
      "contentLong": "Led the development and launch of LTK's first global brand campaign following a significant venture investment and rapid business scaling. Positioned the platform for user and creator growth by translating the brand strategy into a full-funnel activation plan spanning paid, owned, and creator channels. The campaign drove a 12% lift in platform engagement, an 8% increase in customer acquisition, and a 22% gain in brand favorability.",
      "contentGeneric": "Led first global brand campaign for technology platform, driving 12% engagement lift and 8% customer acquisition",
      "brandTags": ["LTK"],
      "categoryTags": ["technology", "fashion", "creator-economy"],
      "functionTags": ["campaign-development", "growth-strategy", "platform-marketing"],
      "outcomeTags": ["platform-engagement", "customer-acquisition", "brand-favorability"],
      "exclusiveMetrics": ["12% engagement lift", "8% customer acquisition", "22% brand favorability"]
    },
    {
      "id": "P1-B09",
      "type": "bullet",
      "position": 1,
      "contentShort": "Built Deloitte's brand platform driving 43% lead generation increase",
      "contentMedium": "Led 'Only See Possible' platform development, driving 43% lead generation increase",
      "contentLong": "Led the development of Deloitte's 'Only See Possible' brand platform, architecting a modular campaign ecosystem designed to unify messaging across industries and offerings. Oversaw strategy, narrative, and executional rollout in partnership with internal creative, media, and performance teams. The platform drove a 43% increase in lead generation and a 33% lift in brand relevancy across five priority sectors.",
      "contentGeneric": "Led corporate brand platform development, architecting modular campaign ecosystem that drove 43% lead generation increase",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["platform-development", "campaign-architecture", "internal-marketing"],
      "outcomeTags": ["lead-generation", "brand-relevancy"],
      "exclusiveMetrics": ["43% lead generation", "33% brand relevancy"]
    },
    {
      "id": "P1-B10",
      "type": "bullet",
      "position": 1,
      "contentShort": "Launched wealth management brand platform driving 23% awareness lift and 37% favorability increase",
      "contentMedium": "Launched wealth management brand platform driving 23% awareness lift and 37% favorability increase",
      "contentLong": "Launched bold brand platform for Fortune 500 insurer's wealth management division that differentiated from traditional financial services through modern visual identity and integrated storytelling, driving 23% brand awareness lift and 37% favorability increase within the first quarter of 2025",
      "contentGeneric": "Launched wealth management brand platform driving 23% awareness lift and 37% favorability increase through modern visual identity and integrated storytelling",
      "brandTags": ["New York Life"],
      "categoryTags": ["financial-services", "insurance", "wealth-management"],
      "functionTags": ["brand-platform", "visual-identity", "storytelling", "differentiation"],
      "outcomeTags": ["brand-awareness", "brand-favorability"],
      "exclusiveMetrics": ["23% awareness lift", "37% favorability increase"]
    },
    {
      "id": "P2-B01",
      "type": "bullet",
      "position": 2,
      "contentShort": "Unified B2B technology platform brand driving 15% awareness increase and 12% YoY acquisition growth",
      "contentMedium": "Unified B2B technology platform brand through creative strategy and messaging architecture",
      "contentLong": "Unified B2B technology platform's fragmented brand across product and sales channels through holistic creative strategy and messaging architecture, delivering 15% awareness increase and 12% year-over-year customer acquisition growth",
      "contentGeneric": "Unified B2B technology platform brand through creative strategy and messaging architecture, delivering 15% awareness increase and 12% YoY acquisition growth",
      "brandTags": ["SAP"],
      "categoryTags": ["technology", "b2b", "enterprise-software"],
      "functionTags": ["brand-unification", "messaging-architecture", "creative-strategy"],
      "outcomeTags": ["brand-awareness", "customer-acquisition"],
      "exclusiveMetrics": ["15% awareness increase", "12% YoY acquisition growth"]
    },
    {
      "id": "P2-B02",
      "type": "bullet",
      "position": 2,
      "contentShort": "Repositioned premium spirits brand driving 13% revenue increase",
      "contentMedium": "Redefined brand positioning for global bourbon brand, driving 13% revenue increase",
      "contentLong": "Redefined the brand positioning and creative strategy for a global bourbon brand during a period of category stagnation and declining consumer relevance. Developed a culturally attuned brand platform and refreshed visual identity that reengaged target audiences and clarified the brand's role in the premium spirits space. The relaunch campaign led to a 13% increase in product revenue within one year.",
      "contentGeneric": "Redefined brand positioning for premium spirits brand, driving 13% revenue increase through culturally attuned platform and refreshed identity",
      "brandTags": ["Wild Turkey"],
      "categoryTags": ["consumer", "spirits", "beverage"],
      "functionTags": ["brand-repositioning", "creative-strategy", "visual-identity"],
      "outcomeTags": ["revenue-growth", "consumer-relevance"],
      "exclusiveMetrics": ["13% revenue increase"]
    },
    {
      "id": "P2-B03",
      "type": "bullet",
      "position": 2,
      "contentShort": "Built brand architecture framework contributing to 3x pipeline growth",
      "contentMedium": "Built data-driven brand architecture system contributing to 3x pipeline increase",
      "contentLong": "Built a data-driven brand architecture system to unify Deloitte Consulting's positioning across its fastest-growing industry sectors. Designed the framework to ensure consistency of narrative, value proposition, and differentiation at both the enterprise and solution levels. The system enabled go-to-market alignment across verticals and contributed to a 3x increase in brand-led pipeline opportunities.",
      "contentGeneric": "Built data-driven brand architecture system for consulting firm, contributing to 3x increase in brand-led pipeline opportunities",
      "brandTags": ["Deloitte"],
      "categoryTags": ["professional-services", "consulting"],
      "functionTags": ["brand-architecture", "framework-development", "positioning-strategy"],
      "outcomeTags": ["pipeline-growth", "market-alignment"],
      "exclusiveMetrics": ["3x pipeline increase"]
    },
    {
      "id": "P2-B04",
      "type": "bullet",
      "position": 2,
      "contentShort": "Launched brand strategy driving 100%+ growth in digital fan engagement",
      "contentMedium": "Led brand and communications strategy driving 100%+ digital fan engagement growth",
      "contentLong": "At a time when the league was experiencing stagnation in reach and relevance, led the development of a new brand and communications strategy to reengage existing fans and connect with a younger, culturally attuned audience. Defined a refreshed brand narrative, messaging architecture, and digital engagement model to activate the league's evolving identity across platforms. The campaign drove over 100% growth in fan engagement through digital channels and reignited momentum with brand partners and fans alike.",
      "contentGeneric": "Led brand and communications strategy for sports league, driving 100%+ growth in digital fan engagement",
      "brandTags": ["WNBA"],
      "categoryTags": ["sports", "entertainment"],
      "functionTags": ["brand-strategy", "communications-development", "fan-engagement"],
      "outcomeTags": ["digital-growth", "fan-engagement"],
      "exclusiveMetrics": ["100%+ digital engagement growth"]
    },
    {
      "id": "P2-B05",
      "type": "bullet",
      "position": 2,
      "contentShort": "Led auto care portfolio rebrand driving 13% YoY sales lift to $182.3M",
      "contentMedium": "Led auto care portfolio rebrand driving 13% YoY sales lift to $182.3M revenue",
      "contentLong": "Led the rebranding of Energizer Holdings' auto care portfolio—including Armor All, STP, and A/C Pro—at a time when the category was contracting and the brands were losing market share to private label competitors. Developed a unified messaging system and refreshed brand identity that reestablished relevance, connected equity across products, and strengthened presence across retail and media. The rebrand contributed to a 13% year-over-year increase in retail sales and helped return the Auto Care segment to growth, with revenue reaching $182.3M in Q2 FY24—a 2.3% increase over the prior year.",
      "contentGeneric": "Led auto care portfolio rebrand driving 13% YoY sales lift to $182.3M revenue through unified messaging and refreshed identity",
      "brandTags": ["Energizer", "Armor All", "STP", "A/C Pro"],
      "categoryTags": ["consumer", "auto-care", "cpg"],
      "functionTags": ["portfolio-rebranding", "message-unification", "retail-strategy"],
      "outcomeTags": ["sales-growth", "revenue-performance", "market-share"],
      "exclusiveMetrics": ["13% YoY sales", "$182.3M revenue"]
    },
    {
      "id": "P2-B06",
      "type": "bullet",
      "position": 2,
      "contentShort": "Developed brand platform driving 16% demand increase and 14% revenue growth",
      "contentMedium": "Developed 'Yes' platform for dental services provider, driving 16% demand and 14% revenue growth",
      "contentLong": "Developed and launched a new brand strategy and creative platform for a national dental services provider seeking to modernize its image and reestablish relevance in a competitive category. Built a segmentation model to identify high-potential patient segments and led the development of the 'Yes' platform—brought to life through real patient stories that highlighted Aspen Dental's culture of saying 'yes' to care, access, and experience. The campaign was activated across national and local TV, radio, paid search, and social, driving a 16% increase in demand and a 14% lift in revenue within the first year.",
      "contentGeneric": "Developed brand platform for national healthcare services provider, driving 16% demand increase and 14% revenue growth",
      "brandTags": ["Aspen Dental"],
      "categoryTags": ["healthcare", "dental", "services"],
      "functionTags": ["brand-strategy", "platform-development", "segmentation", "patient-marketing"],
      "outcomeTags": ["demand-growth", "revenue-growth"],
      "exclusiveMetrics": ["16% demand increase", "14% revenue growth"]
    },
    {
      "id": "P2-B07",
      "type": "bullet",
      "position": 2,
      "contentShort": "Launched gaming beverage exceeding forecasts by 131%, generating $25.7M in 11 weeks",
      "contentMedium": "Led gaming beverage launch exceeding forecasts by 131%, generating $25.7M in 11 weeks",
      "contentLong": "Led the brand launch and national marketing campaign for MTN DEW AMP GAME FUEL, a new beverage formulated specifically for gamers. Positioned the product at the intersection of performance and culture, activating through eSports partnerships, digital content, and the launch of a direct-to-consumer platform with exclusive merchandise and a loyalty program. The campaign exceeded internal forecasts by 131% and generated $25.7M in net revenue within the first 11 weeks post-launch.",
      "contentGeneric": "Led gaming beverage launch exceeding forecasts by 131%, generating $25.7M in net revenue within 11 weeks",
      "brandTags": ["MTN DEW", "PepsiCo", "GAME FUEL"],
      "categoryTags": ["consumer", "beverage", "gaming", "esports"],
      "functionTags": ["brand-launch", "campaign-development", "dtc-platform"],
      "outcomeTags": ["revenue-performance", "launch-success"],
      "exclusiveMetrics": ["131% above forecast", "$25.7M revenue", "11 weeks"]
    },
    {
      "id": "P2-B08",
      "type": "bullet",
      "position": 2,
      "contentShort": "Elevated professional sports league driving 50% YoY attendance growth and securing $60M media deal",
      "contentMedium": "Elevated professional sports league driving 50% attendance growth and $60M media deal (40x increase)",
      "contentLong": "Elevated professional sports league from regional interest to national cultural phenomenon through innovative brand strategy and content-driven fan engagement platform, driving 50% YoY attendance growth and securing $60M media rights deal representing 40x value increase",
      "contentGeneric": "Elevated professional sports league from regional interest to national phenomenon, driving 50% attendance growth and $60M media deal",
      "brandTags": ["NWSL"],
      "categoryTags": ["sports", "entertainment", "media"],
      "functionTags": ["brand-strategy", "fan-engagement", "media-rights"],
      "outcomeTags": ["attendance-growth", "revenue-growth", "media-value"],
      "exclusiveMetrics": ["50% YoY attendance", "$60M media deal", "40x value increase"]
    },
    {
      "id": "P2-B09",
      "type": "bullet",
      "position": 2,
      "contentShort": "Launched pharmaceutical DTC platform generating $727M revenue, exceeding forecasts by 20%",
      "contentMedium": "Launched pharmaceutical DTC platform generating $727M revenue, 20% above forecast",
      "contentLong": "Launched a pharmaceutical company's first direct-to-consumer platform during the pandemic, developing a first-of-its-kind customer experience and digital engagement model that generated $727M in revenue, exceeding forecasts by 20%",
      "contentGeneric": "Launched pharmaceutical DTC platform generating $727M revenue, exceeding forecasts by 20%",
      "brandTags": ["Pfizer"],
      "categoryTags": ["healthcare", "pharmaceutical", "dtc"],
      "functionTags": ["platform-launch", "digital-experience", "brand-strategy"],
      "outcomeTags": ["revenue-generation", "forecast-overperformance"],
      "exclusiveMetrics": ["$727M revenue", "20% above forecast"]
    },
    {
      "id": "P3-B01",
      "type": "bullet",
      "position": 3,
      "contentShort": "Spearheaded go-to-market transformation driving 72% digital engagement increase",
      "contentMedium": "Spearheaded GTM transformation driving 72% digital engagement and 29% brand awareness lift",
      "contentLong": "Spearheaded a go-to-market transformation for Ray-Ban North America to address declining digital engagement and brand visibility. Leveraged behavioral and segment-level insights to redefine channel strategy, optimize messaging, and align activation across media and retail. The integrated approach drove a 72% increase in digital engagement and a 29% lift in brand awareness within key audience segments.",
      "contentGeneric": "Spearheaded go-to-market transformation for fashion brand, driving 72% digital engagement increase and 29% brand awareness lift",
      "brandTags": ["Ray-Ban"],
      "categoryTags": ["consumer", "fashion", "eyewear", "retail"],
      "functionTags": ["go-to-market", "channel-strategy", "messaging-optimization"],
      "outcomeTags": ["digital-engagement", "brand-awareness"],
      "exclusiveMetrics": ["72% digital engagement", "29% brand awareness"]
    },
    {
      "id": "P3-B02",
      "type": "bullet",
      "position": 3,
      "contentShort": "Developed first U.S. campaign achieving 33% awareness lift and 17% conversion increase",
      "contentMedium": "Developed first U.S. campaign achieving 33% awareness, 17% conversion, and 18% online performance lift",
      "contentLong": "Developed and activated the first U.S. national campaign for Soap & Glory following its acquisition by Alliance Boots, introducing the brand to the American market and repositioning it to resonate with a younger, digitally native audience. Built an integrated go-to-market strategy that combined influencer activations, paid media, and experiential storytelling to modernize brand perception and drive omnichannel growth. The campaign surpassed all KPIs—delivering a 33% lift in brand awareness, a 17% increase in sales conversion, and an 18% improvement in online conversion rates.",
      "contentGeneric": "Developed first U.S. campaign for international beauty brand, achieving 33% awareness lift and 17% conversion increase",
      "brandTags": ["Soap & Glory"],
      "categoryTags": ["consumer", "beauty", "personal-care"],
      "functionTags": ["campaign-development", "market-entry", "influencer-marketing"],
      "outcomeTags": ["brand-awareness", "sales-conversion", "online-performance"],
      "exclusiveMetrics": ["33% awareness", "17% conversion", "18% online performance"]
    },
    {
      "id": "P3-B03",
      "type": "bullet",
      "position": 3,
      "contentShort": "Built revenue-generating media strategy framework transforming media from cost center to growth engine",
      "contentMedium": "Built media strategy framework that redefined paid media as growth engine with improved ROI",
      "contentLong": "For decades, media had been treated as a cost center by most retail brands. I built a revenue-generating media strategy framework that redefined paid media as a growth engine—introducing innovation-led models that prioritized content monetization, strategic partnerships, and performance-based planning. The framework improved media ROI across pilot programs and unlocked new revenue streams by connecting brand storytelling directly to commerce.",
      "contentGeneric": "Built revenue-generating media strategy framework that redefined paid media as growth engine with improved ROI",
      "brandTags": [],
      "categoryTags": ["retail", "media"],
      "functionTags": ["framework-development", "media-strategy", "revenue-innovation"],
      "outcomeTags": ["roi-improvement", "revenue-generation"],
      "exclusiveMetrics": []
    },
    {
      "id": "P4-B01",
      "type": "bullet",
      "position": 4,
      "contentShort": "Pioneered branded podcast achieving #1 iTunes position and Cannes Lion recognition",
      "contentMedium": "Pioneered branded podcast achieving #1 iTunes and earning Cannes Lion, Clio, and Webby awards",
      "contentLong": "Pioneered branded audio storytelling by launching The Message podcast for GE, which became a top-charting iTunes hit and earned industry acclaim including a Cannes Lion, Clio Award, and Webby recognition—cementing GE as a leader in innovative brand storytelling.",
      "contentGeneric": "Pioneered branded podcast achieving #1 iTunes position and earning Cannes Lion, Clio, and Webby awards",
      "brandTags": ["GE"],
      "categoryTags": ["industrial", "b2b", "media"],
      "functionTags": ["content-innovation", "audio-strategy", "brand-storytelling"],
      "outcomeTags": ["cultural-impact", "award-recognition"],
      "exclusiveMetrics": ["#1 iTunes", "Cannes Lion", "Clio Award", "Webby"]
    },
    {
      "id": "P4-B02",
      "type": "bullet",
      "position": 4,
      "contentShort": "Directed largest distributed VR campaign with 1M headsets",
      "contentMedium": "Directed largest distributed VR campaign partnering with New York Times to deliver 1M headsets",
      "contentLong": "Directed one of the largest distributed virtual reality brand campaigns ever executed, partnering with The New York Times to deliver immersive branded content at scale—garnering widespread press coverage and significantly elevating brand perception in innovation sectors.",
      "contentGeneric": "Directed one of the largest distributed VR campaigns, partnering with major media outlet to deliver 1M headsets",
      "brandTags": ["GE", "New York Times"],
      "categoryTags": ["industrial", "b2b", "media"],
      "functionTags": ["vr-strategy", "partnership-development", "innovation-marketing"],
      "outcomeTags": ["media-coverage", "brand-perception"],
      "exclusiveMetrics": ["1M VR headsets"]
    },
    {
      "id": "P5-B01",
      "type": "bullet",
      "position": 5,
      "contentShort": "Supported global rebrand across 8,000+ locations in 25 countries",
      "contentMedium": "Supported global rebrand following cross-border merger across 8,000+ locations in 25 countries",
      "contentLong": "Supported the global rebranding of Walgreens Boots Alliance following its cross-border merger, aligning brand positioning, messaging, and identity across retail, pharmacy, and healthcare business units. Worked across strategy and design teams to ensure consistency at scale and support internal adoption of the new global brand system.",
      "contentGeneric": "Supported global rebrand following cross-border merger across 8,000+ locations in 25 countries",
      "brandTags": ["Walgreens Boots Alliance"],
      "categoryTags": ["healthcare", "retail", "pharmacy"],
      "functionTags": ["global-rebrand", "merger-integration", "brand-alignment"],
      "outcomeTags": ["global-consistency", "merger-success"],
      "exclusiveMetrics": ["8,000+ locations", "25 countries"]
    },
    {
      "id": "P5-B02",
      "type": "bullet",
      "position": 5,
      "contentShort": "Led brand strategy for pharmaceutical portfolio of 100+ product SKUs",
      "contentMedium": "Led product architecture and brand strategy for pharmaceutical portfolio of 100+ SKUs",
      "contentLong": "Led product architecture and brand strategy for Teva's U.S. generics portfolio, helping streamline the product hierarchy and improve brand communication across providers and consumers. Built a unified framework to clarify positioning across therapeutic categories, increasing internal alignment and market clarity for more than 100 product SKUs.",
      "contentGeneric": "Led product architecture and brand strategy for pharmaceutical portfolio of 100+ product SKUs",
      "brandTags": ["Teva"],
      "categoryTags": ["healthcare", "pharmaceutical"],
      "functionTags": ["portfolio-strategy", "product-architecture", "brand-framework"],
      "outcomeTags": ["market-clarity", "internal-alignment"],
      "exclusiveMetrics": ["100+ product SKUs"]
    },
    {
      "id": "P6-B01",
      "type": "bullet",
      "position": 6,
      "contentShort": "Contributed to rebrand aligning 50,000+ employees around new positioning",
      "contentMedium": "Contributed to financial services rebrand aligning 50,000+ employees around new positioning",
      "contentLong": "Contributed to the rebrand of a global financial services company by supporting the development of positioning, messaging, and customer promise frameworks. Helped translate audience insights into brand language that aligned internal stakeholders and clarified value propositions across touchpoints.",
      "contentGeneric": "Contributed to financial services rebrand aligning 50,000+ employees around new positioning",
      "brandTags": ["Capital One"],
      "categoryTags": ["financial-services", "banking"],
      "functionTags": ["positioning-development", "messaging", "stakeholder-alignment"],
      "outcomeTags": ["internal-alignment", "value-clarity"],
      "exclusiveMetrics": ["50,000+ employees"]
    }
  ]
}
